

var changeableReminderDict: [Int:String] = [ 0 : "ცუდად გაქვს საქმე",
                                                 1 : "მთავარია დაიწყე, გააგრძელე!",
                                                 2 : "ძალიან ბევრი გაქვს სამუშაო",
                                                 3 : "ბევრი გაქვს სამუშაო",
                                                 4 : "მიზანს უახლოვდები!",
                                                 5 : "ძალიან ცოტა დაგრჩა",
                                                 6 : "Down went the dictator!"
    ]
